NextFOAM-2509/tutorials/multiphase/icoReactingMultiphaseInterFoam/inertMultiphaseMultiComponent/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type    massTransferMultiphaseSystem;

phases  (gas mercury oil liquid);

mercury
{
    type            pureMovingPhaseModel;
}

oil
{
    type            pureMovingPhaseModel;
}

liquid
{
    type            multiComponentMovingPhaseModel;
}

gas
{
    type            multiComponentMovingPhaseModel;
}

surfaceTension
(
    (gas and liquid)
    {
        type            constant;
        sigma           0.005;
    }

    (gas and mercury)
    {
        type            constant;
        sigma           0.005;
    }

    (mercury and gas)
    {
        type            constant;
        sigma           0.005;
    }

    (mercury and oil)
    {
        type            constant;
        sigma           0.005;
    }

    (mercury and liquid)
    {
        type            constant;
        sigma           0.005;
    }

    (gas and oil)
    {
        type            constant;
        sigma           0.005;
    }
    (oil and liquid)
    {
        type            constant;
        sigma           0.005;
    }
);

massTransferModel
(
);


// ************************************************************************* //
